<template>
    <Head>
        <title>Home Page</title>
    </Head>
    <div class="row">
        <div class="col-lg-8">
            <img src="/images/arduino-logo.png" class="rounded float-start" alt="arduino logo"
                 style="margin-right: 20px; margin-bottom: 20px;">
            <p>Arduino – это название сразу нескольких технологий, с помощью которых можно научиться создавать умные
                устройства. Ардуино был придуман в университетской студенческой среде, поэтому эта платформа открыта и
                чрезвычайно доступна. Для начала работы с инженерными проектами не нужно покупать дорогие решения –
                можно легко и дешево купить электронную плату Arduino в интернете на многочисленных интернет-магазинах.
                А программы и все необходимые библиотеки можно скачать бесплатно с официального сайта, на нашем сайте
                arduinomaster.ru или найти на сотнях других ресурсов в интернете.</p>
            <figure class="figure mt-4 mb-4">
                <img src="/images/ARDUINO_UNO_DIP_01.png" class="figure-img img-fluid rounded" alt="plata arduino">
                <figcaption class="figure-caption fst-italic mt-3">Оригинальный и официальный Arduino Uno</figcaption>
            </figure>
            <p>
                Миллионы людей используют ардуино для своих проектов, создавая своими руками интересные решения для
                интернета вещей и умного дома, автомобиля, школы, огорода или интересных интерактивных развлечений.
                Платформа прекрасно подходит для занятий кружков робототехники – вы можете создать и запрограммировать
                первых автономных роботов – автомобилей, танков или дронов.
            </p>
            <h2 class="mt-4 mb-3">
                С чего начать работу с Ардуино
            </h2>
            <p>
                Если вы делаете первые шаги в мире Ардуино, то советуем вам заранее приготовиться к двойному потоку
                знаний. Во-первых, вам придется разобраться с тем, что такое контроллер Arduino, какие устройства можно
                к нему подключить и как это сделать. Потребуется разобраться с основами электроники. Во-вторых, придется
                научиться навыкам программирования в Arduino. Для профессиональной работы нужны знания C++, для
                начинающих доступны многочисленные графические среды с блочным программированием. Например, mBlock или
                ArduBlock. При отсутствии реальной платы можно воспользоваться одним из эмуляторов ардуино.
            </p>
            <p>
                Все это потребует и времени, и знаний, но результатом станет удивительное ощущение восторга от сделанных
                своими руками умных устройств. Счастья от того, что вы стали почти волшебником, приближаясь шаг за шагом
                к вершинам технического мастерства. Крайне важно, чтобы теория сочеталась с практикой и вы как можно
                быстрее переходили от чтения статей к созданию реальных устройств.
            </p>
            <h2 class="mt-4 mb-3">
                Первые шаги Arduino
            </h2>
            <Accordion />
            <h2 class="mt-4 mb-3">
                Ардуино для начинающих
            </h2>
            <p>
                Arduino – это возможность делать сложные и умные вещи просто. Идеальный вариант для первых шагов начинающих технических гениев. Вы можете легко собрать электронные схемы из готовых конструкторов и наборов, загрузить готовую программу, которую можно скачать совершенно бесплатно и начать использовать умное электронное устройство.
            </p>
            <p>
                Arduino – это электронные платы, к которым можно подсоединять различные датчики, двигатели, экраны и много других электронных компонентов. Плата Ардуино будет управлять этими компонентами с помощью программы, который вы в нее загрузите. Самые популярные платы для начинающих – это Arduino Uno, Arduino Mega, Arduino Nano и Arduino Leonardo. Кроме этого есть множество  других вариантов, подходящих для конкретных случаев.
            </p>

            <p>
                Arduino – это еще и совершенно бесплатная среда программирования Arduino IDE, в которой можно писать программы (скетчи) для контроллера. Программа прошивается в микроконтроллер буквально одним нажатием на кнопку. Никаких особых знаний не требуется!  Вы можете даже не писать программу – просто найти и скачать готовый скетч, который просто откроете в Arduino IDE.
            </p>

            <p>
                Arduino – это сообщество инженеров, всегда готовых помочь советом. Это огромное количество сайтов с документацией, примерами и схемами. Начать можно с официального сайта, но кроме него сегодня появилось огромное количество сайтов на русском с форумом русскоязычных инженеров.
            </p>

            <CardGroup v-for="(category, key) in articles" :title="key" :cards="category" :cards-in-row="3"/>
        </div>
        <div class="col-lg-4">
            <CardGroup :cards="shared.topArticles" title="Top" :cards-in-row="1"/>
        </div>
    </div>
</template>
<script>
import {Head, Link} from "@inertiajs/inertia-vue3";
import Navbar from "../Shared/Navbar.vue";
import CardGroup from "../Shared/Card/CardGroup.vue";
import Accordion from "../Shared/Accordion.vue";

export default {
    components: {Accordion, CardGroup, Navbar, Head, Link},
    props: {
        articles: Object,
        shared: Object
    }
}
</script>
