<template>
    <div class="accordion accordion-flush my-4" id="accordionFlushExample">
        <div class="accordion-item" v-for="(item, index) in steps" :key="index">
            <h2 class="accordion-header" :id="`flush-heading-${index}`">
                <button class="accordion-button collapsed" type="button" data-bs-toggle="collapse" :data-bs-target="`#flush-collapse-${index}`" aria-expanded="false" :aria-controls="`flush-collapse-${index}`">
                    {{ item.title }}
                </button>
            </h2>
            <div :id="`flush-collapse-${index}`" class="accordion-collapse collapse" :aria-labelledby="`flush-heading-${index}`" data-bs-parent="#accordionFlushExample">
                <div class="accordion-body">
                    <p v-for="p in item.paragraph">
                        {{ p }}
                    </p>
                </div>
            </div>
        </div>
    </div>
</template>

<script>
export default {
    name: "Accordion",
    data() {
        return {
            steps: [
                {
                    title: 'Выбрать плату Arduino',
                    paragraph: [
                        'Подобрать плату контроллера достаточно простая задача, сегодня в интернете полно интернет-магазинов с очень широким выбором разных плат. Для начинающих самой подходящей будет плата Arduno Uno. Ее можно без проблем купить в России и в зарубежных интернет-магазинах по цене меньше 300 рублей. Для реальных проектов можно использовать миниатюрную плату Arduino Nano или вариант с большим объемом памяти и с большим количеством пинов – плату Arduino Mega. Для профессиональных решений подойдет плата Arduino Pro Mini, а для необычных проектов, в которых требуется тесная интеграция с компьютером – Leonardo.',
                        'Альтернативой отдельным устройствам может стать готовый набор или конструктор Ардуино. Как правило, там есть все необходимое для быстрого старта: контроллер, макетные платы, электронные компоненты и датчики. Купить готовый набор Ардуино можно в российских интернет-магазинах (например, наборы Амперки). Есть более дешевый, но затратный по времени вариант покупки конструктора Ардуино на Aliexpress.',
                        'Ну и всегда остается вариант начать работу без покупки реальной платы. Просто используйте один из многочисленных эмуляторов и симуляторов. На нашем сайте вы найдете обзоры наиболее популярных и совершенно бесплатных сервисов.'
                    ]
                },
                {
                    title: 'Научиться собирать электронные схемы',
                    paragraph: [
                        'На сайте представлено много разных материалов о самых разнообразных устройствах и способах их подключения к платам Ардуино. Вы можете подключить датчики, светодиоды, LCD-экраны, шилды, двигатели, реле и много-много других устройств. Как правило, все эти элементы достаточно дешевы и очень легко находятся в интернете. Благодаря этому нет никаких преград для создания умных устройств.',
                        'Отдельно следует упомянуть коммуникационные возможности Ардуино: вы можете объединять устройства с помощью модуля bluetooth, радио модуля nrf24l01, а также с помощью готовых  плат Wemos и NodeMcu с поддержкой WiFi на платформе esp8266.',
                        'В большинстве случаев вам не придется тратить на изучение много времени – почти все устройства Arduino подключаются к плате стандартным и очень простым способом. Для монтажа схем в самом начале обучения рекомендуем использовать макетные платы. Естественно, вам пригодятся и другие навыки, например, для работы с мультиметром. На сайте также можно найти материалов по очень популярной среде графического моделирования схем Fritzing.'
                    ]
                },
                {
                    title: 'Скачать и настроить Arduino IDE',
                    paragraph: [
                        'Писать программы можно множеством разных способов. Самый распространенный и доступный – скачать Arduino IDE на русском с нашего или официального сайта ардуино. IDE – это среда программирования, в ней есть все необходимое для написания первых скетчей. Программа бесплатная и любой желающий может посмотреть исходники Arduino в официальном репозитории. Все последние версии Arduino IDE поддерживают русский интерфейс.',
                        'Если скачивать не хочется, то можно воспользоваться официальной Web-версией среды разработки Arduino.',
                        'Если хочется научиться программировать, а самой платы еще нет, попробуйте онлайн-редактор на официальном сайте arduino или отличный сервис виртуального проектирования и программирования Tinkercad.'
                    ]
                },
            ]
        }
    }
}
</script>
